# Power Users

We define as power users those users who bought at least 10 products. Write a query that returns for each user on which day they became a power user. That is, for each user, on which day they bought the 10th item.

The table below represents transactions. That is, each row means that the corresponding user has bought something on that date.

In [1]:
import pandas as pd
url = 'https://raw.githubusercontent.com/data-eng-10-21/interview-questions/main/ds-sql/1-power-users/query_three.csv'
df = pd.read_csv(url, index_col = 0)

In [2]:
import sqlite3

conn = sqlite3.connect('power_users.db')

In [3]:
df.to_sql('users', conn, if_exists = 'replace')

In [4]:
pd.read_sql('select * from users', conn)

       user_id                 date
0          675  2014-12-31 16:16:12
1         1967  2014-12-31 16:37:57
2           57  2014-12-31 17:05:32
3         1532  2014-12-31 17:26:25
4         1831  2014-12-31 18:20:54
...        ...                  ...
19995     1656  2015-12-30 13:18:16
19996      381  2015-12-30 14:31:49
19997     1891  2015-12-30 15:10:35
19998      977  2015-12-30 15:30:15
19999     1076  2015-12-30 15:59:38

[20000 rows x 2 columns]

In [32]:
pd.read_sql("""select * from (select user_id, date, 
count(user_id) over( partition by user_id order by date) num_purchases
from users) as user_purchases where user_purchases.num_purchases = 10
""", conn)

      user_id                 date  num_purchases
0           1  2015-10-21 06:20:14             10
1           3  2015-10-29 22:41:00             10
2           4  2015-09-25 12:36:10             10
3           5  2015-09-18 06:25:40             10
4           6  2015-12-30 00:53:59             10
...       ...                  ...            ...
1093     1993  2015-10-11 11:14:38             10
1094     1994  2015-11-02 04:40:47             10
1095     1997  2015-10-15 22:43:31             10
1096     1998  2015-07-27 01:50:04             10
1097     1999  2015-10-18 15:27:42             10

[1098 rows x 3 columns]

### Answer

<img src="./user-date.png" width="40%">